package review230927;

public class repeat {
	public static void main(String[] args) {
		//조건문 : if-else if else문, swirch
		// 조건문을 만족하면? -> 하위 조건 스킵
		// 조건문을 만족하지 못하면 -> 하위 조건 검수 모두 만족하지 못하면 else 수행
		// 
		/*if(){
		 * 조건문이 참일 경우 현위치의 내용을 수행
		 * }
		 * else if(){
		 * 조건문이 참일 경우 현위치의 내용을 수행
		 * }
		 * else{
		 * 상위 조건이 모두 거짓일 경우 현 위치의 내용을 수행
		 * }
		 * switch(@){ 경우에 따라 아래 케이스 중 하나를 수행
		 * case ~ : {
		 * @가 ~와 같을때 이 케이스 안의 내용을 수행
		 * break;
		 * }
		 * default : {
		 * @가 케이스에 만족하지 못할때 default(기본값)을 수행
		 * break;
		 * }
		 * */
		
		//반복문 : (조건이 참일 경우)동일한 명령문을 반복하는 구문
		/* while, for, do-while 
		 * while(@){
		 * @를 만족할 시, 내부의 내용을 반복 수행
		 * } */
		/*for(@;#;$){ @:제어변수, #:조건, $루프 후처리
		 * 조건이 참일 경우 내부 내용을 수행
		 * }#을 제외한 나머지는 생략이 가능하다.*/
	}
}
